Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateCornice Property
 Could not create Wall Sweep. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateCornice { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateCornice As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateCornice {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace